application/ecpms-sd/backend/controllers/CityController.php

    public function actionCreate()
    {
        $model = new City();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `city` (`city_name`, `city_code`) VALUES ('Paranaque', 1700)