application/ecpms-sd/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `firstname`, `lastname`, `middlename`, `auth_key`, `role`, `status`) VALUES ('admin', 'admin@gmail.com', '$2y$13$3NyI2ZIr9uYoGfy94WVb0.aTV/6.sWaMDkAPqmVXZpOvRrUMi1z5S', 'admin', 'admin', 'admin', '8u_rTFyXNpxEnuuRz6RIsKH_wlEgYxDk', 10, 10)
---
    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->username = $this->username;
            $user->email = $this->email;
            $user->setPassword($this->password);
            $user->firstname = $this->firstname;
            $user->lastname = $this->lastname;
            $user->middlename = $this->middlename;
            $user->generateAuthKey();
            if ($user->save()) {